#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>
#include<stdlib.h>
int main()
{
	int a = 10;
	int b = -1;//存补码
	int c = -20;
	int d = 20;
	int f = 40;
	int e = -40;
	//原码：10000000 00000000 00000000 00010100 //20的十六进制：00 00 00 14
	//反码：11111111 11111111 11111111 11101011
	//补码：11111111 11111111 11111111 11101100
	//十六进制：ff   ff       ff       ec
	//存储：ec ff ff ff
	//
	//40:
	//00000000 00000000 00000000 00101000
	//00       00       00       28
	//-40:
	//原码：10000000 00000000 00000000 00101000
	//反码：11111111 11111111 11111111 11010111
	//补码：11111111 11111111 11111111 11011000
	//十六进制：ff   ff       ff       d8
	//存储（小端）：d8 ff ff ff
	//    存储时 低地址-->高地址
	return 0;
}